#### Getting name and Age and say them a Greeting

In [6]:
name = input("Enter the Name : ")
age = int(input("Enter the Age : "))
print(f"Hello {name} Welcome you at {age} years old")

Enter the Name :  HEndry
Enter the Age :  21

Hello HEndry Welcome you at 21 years old

#### Creating a list and printing the even Numbers only from the list

In [12]:
numbers = range(1,51)
even_numbers = []
for i in numbers:
    if i%2 ==0:
        even_numbers.append(i)
print(even_numbers)

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50]

#### Handing Zero Division Error

In [30]:
numerator = int(input("Enter the Numerator : "))
denominator = int(input("Enter thr Denominator : "))
try:
    result = numerator/denominator
    print(result)
# except ValueError:
#     print("Enter a Valid Charecter not a String")
except Exception as e:
    print(f"Error : {e}")
finally:
    print("Program Ended")

Enter the Numerator :  2
Enter thr Denominator :  10

0.2
Program Ended

#### Counting Vowels in User Given word

In [41]:
word = input("Enter a Word : ").lower()
vowels = 'aeiou'
count = 0

for i in word:
    if i in vowels:
        count+=1
print(count)

Enter a Word :  Element

3

#### Reversing a list without using built-in function

In [57]:
number = [1,2,3,4,5]
reverse = []
for i in number:
    reverse.append(number[-i])
print(reverse)

[5, 4, 3, 2, 1]

#### Create a Dictionary with 5 Key-Value Pairs

In [65]:
import pandas as pd
student_marks=pd.DataFrame({"Name":["Hendry","David","Albert","Michel"],"Age":[30,24,21,20],"Maths":[70,80,65,79],"Science":[75,78,76,67],"Social":[80,78,67,89]})
student_marks

     Name  Age  Maths  Science  Social
0  Hendry   30     70       75      80
1   David   24     80       78      78
2  Albert   21     65       76      67
3  Michel   20     79       67      89

In [67]:
student_marks.to_csv("students_marks.csv")

#### Reading a CSV file and print top 5 rowa

In [63]:
pd.read_csv("data.tsv.txt",sep="\t").head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

#### Create a DataFrame using Python Dictionaries and pandas library

In [68]:
import pandas as pd
student_marks=pd.DataFrame({"Name":["Hendry","David","Albert","Michel"],"Age":[30,24,21,20],"Maths":[70,80,65,79],"Science":[75,78,76,67],"Social":[80,78,67,89]})
student_marks

     Name  Age  Maths  Science  Social
0  Hendry   30     70       75      80
1   David   24     80       78      78
2  Albert   21     65       76      67
3  Michel   20     79       67      89

#### Replacing Mean Values of column in Empty Places

In [75]:
employee=pd.read_csv("employee_data.csv")
employee

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech      NaN  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022
7    Nasir  31.0    IT Tech      NaN  12-11-2020

In [71]:
employee.drop_duplicates(inplace=True)

In [72]:
employee

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech      NaN  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022

In [84]:
mean_salary=employee["Salary"].mean()

In [85]:
employee["Salary"].fillna(mean_salary,inplace=True)

C:\Users\Hp\AppData\Local\Temp\ipykernel_6216\2670028496.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  employee["Salary"].fillna(mean_salary,inplace=True)

In [86]:
employee

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech  62500.0  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022
7    Nasir  31.0    IT Tech  62500.0  12-11-2020

#### Filtering rows when there is Age greater than 30

In [87]:
employee

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech  62500.0  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022
7    Nasir  31.0    IT Tech  62500.0  12-11-2020

In [88]:
employee["Age"]>30

0    False
1     True
2    False
3    False
4    False
5     True
6     True
7     True
Name: Age, dtype: bool

In [90]:
employee[employee["Age"]>30]

    Name   Age Department   Salary   Join_Date
1  Nasir  31.0    IT Tech  62500.0  12-11-2020
5  Navin  35.0    Support  72000.0  19-08-2023
6    NaN  40.0         IT  64000.0  10-09-2022
7  Nasir  31.0    IT Tech  62500.0  12-11-2020